Revit 2026 API

# FileExportingEventArgsPath Property

---

The target path for the export.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Path { get; }
```
```vb
Public ReadOnly Property Path As String
	Get
```
```cpp
public:
property String^ Path {
	String^ get ();
}
```
```fsharp
member Path : string with get
```

#### Property Value

String

When several files are exported at the same time, 'Path' property will just report the directory instead of those full file names.

#### Reference

FileExportingEventArgs Class

Autodesk.Revit.DB.Events Namespace